app/controllers/school_classes_controller.rb

UPDATE "school_classes" SET "title" = ?, "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "Risk Analysis"], ["room_number", 10], ["updated_at", "2017-04-10 18:56:54.492135"], ["id", 1]]
---
  def update
    set_school_class
    @school_class.update( school_class_params )

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT 1  [["id", 1]]
---
  def set_school_class
    @school_class = SchoolClass.find( params.require( :id ) )