app/controllers/students_controller.rb

  def update
    set_student
    @student.update( student_params )
---
UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Lindsey"], ["last_name", "Stirling"], ["updated_at", "2017-04-10 18:45:26.432096"], ["id", 1]]

  def set_student
    @student = Student.find( params.require( :id ) )
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", 1]]